$(document).ready(function(){
    $("#poem").click(function(){
        change();
    })
})


function change()
{
    console.log("2");
var i = Math.floor(Math.random() * subtitleList.length);
$("#poem").fadeOut();
$("#poem").html(subtitleList[i]) ;
$("#poem").fadeIn();
}

var subtitleList = [
        "衣带渐宽终不悔，为伊消得人憔悴。",
        "两情若是久长时，又岂在朝朝暮暮。",
        "相思相见知何日？此时此夜难为情。",
        "曾经沧海难为水，除却巫山不是云。",
        "似此星辰非昨夜，为谁风露立中宵。",
        "直道相思了无益，未妨惆怅是清狂。",
        "此情可待成追忆，只是当时已惘然。",
        "身无彩凤双飞翼，心有灵犀一点通。",
        "天长地久有时尽，此恨绵绵无绝期。",
        "在天愿作比翼鸟，在地愿为连理枝。",
        "尊前拟把归期说，未语春容先惨咽。",
        "千金纵买相如赋，脉脉此情谁诉。",
        "一场寂寞凭谁诉。算前言，总轻负。",
        "鱼沈雁杳天涯路，始信人间别离苦。",
        "执手相看泪眼，竟无语凝噎。",
        "诚知此恨人人有，贫贱夫妻百事哀。",
        "春心莫共花争发，一寸相思一寸灰。",
        "忍把千金酬一笑？毕竟相思，不似相逢好。",
        "泪眼问花花不语，乱红飞过秋千去。",
        "若教眼底无离恨，不信人间有白头。",
        "明月不谙离恨苦，斜光到晓穿朱户。",
        "临别殷勤重寄词，词中有誓两心知。",
        "欲寄彩笺兼尺素，山长水阔知何处。",
        "贾化窥帘韩掾少，宓妃留枕魏王才。",
        "落花踏尽游何处，笑入胡姬酒肆中。",
        "锦瑟无端五十弦，一弦一柱思华年。",
        "蓬山此去无多路，青鸟殷勤为探看。",
        "重帏深下莫愁堂，卧后清宵细细长。"
    ];